# Задание №1. Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

number1 = 87
number2 = 3.14
text = 'Alex'
tuple_names = ("Oleg", "Ivan", "Dmitriy")
list_nums = [1, 2, 3, 4, 5]

print(f'Объект {number1=} имеет тип {type(number1)}')
print(f'Объект {number2=} имеет тип {type(number2)}')
print(f'Объект {text=} имеет тип {type(text)}')
print(f'Объект {tuple_names=} имеет тип {type(tuple_names)}')
print(f'Объект {list_nums=} имеет тип {type(list_nums)}')
